

# Задача номер 1 для дз по знакомству с питоном
# n = int(input('n = Введите любое число ')) 
# count = 0
# for i in range(n):
#     x = int(input('x = Введите число от [0 до 1] '))
#     if x < 1:
#         count += 1
#     else:
#         count = count
# print (count , ' - число монет, которые нужно перевернуть')   

# Задача 2 для дз по знакомству с языком питон
s = int(input('s = Введите первое  число '))
p = int(input('p = Введите второе  число '))
for x in range(s):
    for y in range(p):
        if (x+y==s and x*y==p):
            print(x, y)
        
# Задача 3 для дз по знкомству с питоном
# n = int(input('n = Введите число ')) 
# for i in range(n):
#     summ = 2**i
#     if summ > n:
#         break
#     print('2 в степени = ', summ)









